# DocumentSet Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentSet Constructor
DocumentSet Class See Also
---
Initializes a new instance of the DocumentSet class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DocumentSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DocumentSet()
```

# See Also
DocumentSet Class
Autodesk.Revit.DB Namespace